#+OPTIONS: ^:nil
** Run it
To install or update this configuration, run =org-babel-tangle= to
export all the scripts and configuration files to the right
place. Afterwards, the following python script should run.[fn:1] It does two
things:
  - Clear all current keybindings, so that we won't be stuck with old
    bindings after getting rid of them.
  - Load the ratpoison rc file

After this script runs the first time, the configuration should load
every time ratpoison starts
#+NAME: _post-tangle
#+BEGIN_SRC python :noweb tangle :results none
  import subprocess

  rp_cmd = ["ratpoison", "-c", "help"]
  rp = subprocess.Popen(rp_cmd, stdout = subprocess.PIPE)
  bindings = rp.stdout.read().decode().split("\n")

  for b in bindings:
      if len(b) == 0: continue
      binding = b.split(" ", 1)[0]
      subprocess.call(["ratpoison", "-c", "unbind " + binding])

  subprocess.call(["ratpoison", "-c", "source /home/ben/.ratpoisonrc"])
#+END_SRC

[fn:1] Requires the following elisp snippet or equivalent in your
init.el. =org-babel-post-tangle-hook= runs in a temporary buffer for
every file that gets tangled to, so use an advice for the post-tangle
case.

#+BEGIN_SRC elisp :exports results
  (find-function 'my-org-babel-pre-tangle)
  (buffer-substring (point)
                    (search-forward "(ad-activate 'org-babel-tangle)"))
#+END_SRC

#+RESULTS:
#+begin_example
(defun my-org-babel-pre-tangle ()
  (when (member "_pre-tangle" (org-babel-src-block-names))
    (save-excursion
      (org-babel-goto-named-src-block "_pre-tangle")
      (org-babel-execute-src-block))))

(defun my-org-babel-post-tangle ()
  (when (member "_post-tangle" (org-babel-src-block-names))
    (save-excursion
      (org-babel-goto-named-src-block "_post-tangle")
      (org-babel-execute-src-block))))

(add-hook 'org-babel-pre-tangle-hook  'my-org-babel-pre-tangle)

;; org-babel-post-tangle-hook is run in every tangled buffer, so we
;; need to use an advice
(defadvice org-babel-tangle (after specialblock)
  "Run a named src block to post-process / execute a named src
block"
  (print (current-buffer))
  (my-org-babel-post-tangle))
(ad-activate 'org-babel-tangle)
#+end_example

** Frames
#+BEGIN_SRC ratpoison :tangle ~/.ratpoisonrc
bind f fselect
bind C-f fselect
set framesels asdfjkl;qweruiopzxcvnm,./ghbty

bind W split
bind S exec ratpoison -c split; ratpoison -c focusdown;
bind A hsplit
bind D exec ratpoison -c hsplit; ratpoison -c focusright;

bind Tab focus
bind C-Tab focuslast
bind C-A exchangeleft
bind C-D exchangeright
bind C-W exchangeup
bind C-S exchangedown
bind a focusleft
bind d focusright
bind w focusup
bind s focusdown
bind q only
bind e remove
bind C-a removeleft
bind C-d removeright
bind C-w removeup
bind C-s removedown

bind F curframe
bind r resize
bind R resize
#+END_SRC

#+RESULTS:
: 0

